findings/chunk_20260706_093754/bench_dynamic_sharegpt.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f5a5841fac0>, trust_remote_code=False, seed=0, num_prompts=150, dataset_name='sharegpt', no_stream=False, dataset_path='/root/vllm-experiment/data/sharegpt_v3.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url=None, host='localhost', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='/model/ModelScope/Qwen/Qwen2.5-Coder-7B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['tag=dynamic_sharegpt'], result_dir='/root/experiment/findings/chunk_20260706_093754', result_filename=None, ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,e2el', metric_percentiles='50,95,99', goodput=None, request_id_prefix='bench-e430775a-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 150/150 [00:24<00:00,  6.01it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     150       
Failed requests:                         0         
Benchmark duration (s):                  24.96     
Total input tokens:                      33209     
Total generated tokens:                  25256     
Request throughput (req/s):              6.01      
Output token throughput (tok/s):         1011.67   
Peak output token throughput (tok/s):    1625.00   
Peak concurrent requests:                150.00    
Total token throughput (tok/s):          2341.91   
---------------Time to First Token----------------
Mean TTFT (ms):                          5692.54   
Median TTFT (ms):                        5633.26   
P50 TTFT (ms):                           5633.26   
P95 TTFT (ms):                           12378.20  
P99 TTFT (ms):                           13276.92  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          21.43     
Median TPOT (ms):                        20.87     
P50 TPOT (ms):                           20.87     
P95 TPOT (ms):                           25.30     
P99 TPOT (ms):                           30.51     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9098.42   
Median E2EL (ms):                        8959.14   
P50 E2EL (ms):                           8959.14   
P95 E2EL (ms):                           18807.55  
P99 E2EL (ms):                           22638.61  
==================================================